package com.abc.part_two;

public class BasicTypeConversion {
    /**
     *基本类型转换
     */
    public static void main(String [] args){
        /**
         *基本类型转换分为自动类型转换和强制类型转换
         */
        /**
         * 自动类型转换
         *Java 所有的数值型变量可以相互转换，如果系统支持把某种基本类型的值直接赋给另一种基本类型的变量 ，则这种方式被称为自动类型转换
         * 当把一个表数范围小的数值或变量直接赋给另一个表数范围大的变量时，系统将可以进行自动类型转换，否则就需要强制转换
         *表数范围小的可以向表数范围大的进行自动类型转换，就如同有两瓶水，当把小瓶里的水倒入大瓶中时不会有任何问题
         *
         *
         *
         */
        System.out.println('a');
    }
}
